#1)0-დან 100-მდე გამოიტანეთ ყველა რიცხვი .
for i in range(100):
    print(i)

min = 1
while min <= 100:
    print(min)
    min +=1
#2)10 დან 200 მდე გამოიტანეთ ისეთი რიცხვები რომლებიც იყოფა 10 ზეც და 15 ზეცც უნაშთოდ(ანუ 10 ის და 15 ის ჯერადი რიცხვები)
min = 10
while min <= 200:
    min += 1
    if min % 10 == 0:
        print(min)
    elif min % 15 == 0:
        print(min)
        #მომხმარებელს შემოატანინეთ რიცხვი და 2-დან ამ რიცხვის ჩათვლით გამოიტანეთ ყველა რიცხვი.,
i = int(input("შეიყვანეთ რიცხვი: "))
for i in range(2, i + 1):
    print(i)
#4)მომხმარებელს შემოატანინეთ რიცხვი და ამ რიცხვიდან 0-მდე გამოიტანეთ ყველა რიცხვი უკუსვლით.
i = int(input("შეიყვანეთ რიცხვი: "))

for i in range(i, -1, -1):
    print(i)
#საიდუმლო რიცხვი
secret = 7 

while True:
    guess = int(input("შეიყვანეთ რიცხვი: "))
    if guess == secret:
        print("სწორია! თქვენ გამოიცანით რიცხვი.")
        break
    else:
        print("არასწორია, სცადეთ კიდევ!")
#400-დან 200-მდე უკუსვლით გამოიტანეთ ყველა რიცხვი.
for i in range(400, 199, -1):
    print(i)
#მომხმარებელს შემოატანინე რიცხვი, მანამ სანამ არ შემოიტანს  ტექტს - 'გამოთვალე საშუალო'. როგორც კი ამ ტექტს შემოიყვანს დაპრინტეთ ყველა შემოტანილი რიცხვის საერთო საშუალო არითმეტიკული.
total = 0
count = 0
while True:
    user=input("შემოიყვანე რიცხვი ან გამოთვალე საშუალო")
    if user=="გამოთვალე საშუალო":
        if count > 0:
            print("საშუალო არითმეტიკული არის", total/count )
        else:
            print("არცერთი რიცხვი არგაქვს შემოყვანილი")
        break
    if user.isdigit():
        total += int(user)
        count+=1
    else:
        print("გამოთვალე საშუალო")
#მომხმარებლის შემოტანილი რიცხვის ჩათვლით გამოიტანეთ ყველა რიცხვის კვადრატი.
number = int(input("შემოიყვანე რიცხვი"))
for i in range(1, number+1):
    print(i, "კვადრატი უდრის",i*i)