# 1) ფუნქცია არის კოდის ბლოკი, რომელიც ასრულებს კონკრეტულ დავალებას.
# ფუნქცია გვაძლევს საშუალებას ერთხელ დაწერილი კოდი მრავალჯერ გამოვიყენოთ.

# 2) არგუმენტი არის მნიშვნელობა, რომელსაც ფუნქციას გადავცემთ,
# რათა მან ამ მნიშვნელობაზე იმუშაოს.

# 3) ჩაშენებული ფუნქცია არის ისეთი ფუნქცია,
# რომელიც უკვე არსებობს Python-ში და ჩვენ თვითონ არ გვიწევს მისი შექმნა.
# მაგალითები:
# print()  ბეჭდავს ინფორმაციას ტერმინალში
# len()    ითვლის ელემენტების რაოდენობას
# type()   გვიჩვენებს მონაცემის ტიპს

numbers = [1, 2, 3, 4]


def five_plus_five():
    print(5 + 5)


five_plus_five()



def greet():
    name = "გიორგი"  
    print("მოგესალმებით, ჩემი სახელია", name)

greet()



def more_or_less():
    print(5 > 7)   

more_or_less()
