#Ახსენით რა არის პირობითი ოპერატორები 
 #პირობითი ოპერატორები ეს არის კონსტრუქციები პროგრამირებაში, რომლებიც გამოიყენება იმისთვის, რომ პროგრამამ გარკვეული პირობის მიხედვით შეასრულოს ან არ შეასრულოს
#Ახსენით რა არის ლოგიკური ოპერატორები
#ლოგიკური ოპერატორები — ეს არის სპეციალური სიტყვები, რომლებიც პროგრამირებაში გამოიყენება ლოგიკური მართალი ან მცდარი პირობების შესამოწმებლად და ერთმანეთთან დასაკავშირებლად.
num = int (input("0"))
if num > 0 and num % 2==0:
    print("რიცხვი დადებითი და ლუწია")
else:
     print("პირობა არ შესრულდა")
     x = int(input("შეიყვანე რიცხვი: "))

if x < 10 or x == 0:
    print("პატარა ან ნულია")
else:
    print("არ აკმაყოფილებს")
    True and False or True or False and False and True or False and False
True and False 
True or False