
num = int(input("შემიყვანეთ რიცხვი:"))
if num > 0:
    print("რიცხვი დადებითია")
else:
    print("რიცხვი არ არის დადებითი")
    
num = int(input("შეიყვანე რიცხვი: "))

if num == 10:
    print("რიცხვი არის 10-ის ტოლი")
else:
    print("რიცხვი არ არის 10-ის ტოლი")


# მომხმარებელს შემოატანინებს ქულას
score = int(input("შეიყვანე შენი ქულა: "))

# ამოწმებს ჩააბარა თუ ჩაიჭრა
if score >= 81:
    print("შენ ჩააბარე გამოცდა! ")
else:
    print("სამწუხაროდ ჩაიჭერი. ")

a = int(input("შემოიყვანე პირველი რიცხვი:"))
b = int(input("შემოიყვანე მეორე რიცხვი: "))
# ამოწმებს ორივე დადებითია თუ არა
if a > 0 and b > 0:
    print("ორივე პირობა სწორია ")
else:
    print("პირობა არასწორია ")
    
# მომხმარებელს შემოატანინებს ორ რიცხვს
a = int(input("შეიყვანე პირველი რიცხვი: "))
b = int(input("შეიყვანე მეორე რიცხვი: "))

# ამოწმებს ერთ-ერთი რიცხვი მაინც მეტია თუ არა 5-ზე
if a > 5 or b > 5:
    print("ერთ-ერთი პირობა მაინც სწორია ")
else:
    print("არც ერთი პირობა არ შესრულდა ")